[
  {
    "id": "cp-1764943938545",
    "name": "Restoring AgriSolution Enterprises",
    "slug": "restoring-agrisolution-enterprises",
    "description": "Restoring AgriSolution Enterprises is a social-impact agribusiness committed to transforming rural livelihoods through sustainable agriculture, value chain development, and climate-smart innovations. Operating in Sierra Leone, the enterprise aims to increase food security, generate employment, and empower smallholder farmers particularly women and youth through integrated services and market access.\r\nRestoring AgriSolution Enterprises is a dynamic agri-business established in 2021 in Nongowa chiefdom. As a locally rooted enterprise, it is committed to cultivating crops and providing training on Agri business for women and youths with a strategic focus on rice, cassava, potato, Vegetables and maize farming.\r\nRestoring AgriSolution Enterprises concentrates on improving production, processing, and marketing. Despite facing significant hurdlesincluding poor road infrastructure, pest infestations, erratic weather patterns, and the high cost of equipment's the enterprise continues to apply innovative and climate-smart farming techniques to drive impact and resilience.\r\nAt the heart of Restoring AgriSolution Enterprise's mission is a deep concern for food insecurity among vulnerable populations. Over 80% of children from low-income households lack access to nutritious, high-quality food, leading to widespread malnutrition, illness, and preventable deaths. Alarmingly, 70% of these children's parents are unemployed or underpaid youth and single mothers, whose limited livelihood options further compound the crisis.\r\nThrough its work, RestoringAgriSolution Enterprises seeks not only to produce food, but to nurture hope, restore dignity, and empower communities especially youth and women by creating inclusive agricultural opportunities and contributing to a healthier, more food-secure Sierra Leone.",
    "website": "",
    "focus": "Agriculture, Food Security, Youth & Women Empowerment",
    "established": "2021",
    "location": "Nongowa Chiefdom, Sierra Leone",
    "mission": "To nurture hope, restore dignity, and empower communities especially youth and women by creating inclusive agricultural opportunities and contributing to a healthier, more food-secure Sierra Leone.",
    "logo": "/uploads/1764943938537-WhatsApp Image 2025-12-05 at 13.55.47_0022de53.jpg",
    "team": [],
    "createdAt": "2025-12-05T14:12:18.545Z"
  }
]
