[
  {
    "id": "event-1765027992236",
    "title": "16 Days of Activism Against Gender-Based Violence – 2025 Campaign",
    "location": "Kenema, Eastern Province, Sierra Leone (CArCRT Headquarters & community outreach locations)",
    "description": "The Coalition for Community Resilience and Transformation (CArCRT) joins the global movement for the 16 Days of Activism Against Gender-Based Violence, a worldwide campaign that begins on 25 November (International Day for the Elimination of Violence Against Women) and ends on 10 December (Human Rights Day).\r\nThis year, we are raising awareness, strengthening community protection systems, and empowering women, girls, youth, and vulnerable groups through advocacy dialogues, community engagements, media outreach, school sensitizations, and survivor-centered support actions.\r\nWe invite community members, youth leaders, stakeholders, and partners to stand with us in saying NO to violence and YES to a safer, more inclusive Sierra Leone.",
    "status": "ongoing",
    "registrationLink": "",
    "image": "/uploads/1765027992212-4dc3587d-e01f-4f6a-a2d1-cc54c750f032.png",
    "dateFrom": "2025-11-25",
    "dateTo": "2025-12-10",
    "registrationNote": "Registration Not Required / Open to Public"
  },
  {
    "id": "event-1765031427366",
    "title": "CArCRT Formally Known as CADaCT-SL engages in mass campaign against drug abuse in Kenema",
    "dateFrom": "2025-11-15",
    "dateTo": "2025-11-15",
    "location": "Kenema City Sierra Leone ",
    "description": "Coalition Against Drugs Abuse and Community Transformation (CArCRT-SL). The Cross of Christ Association (CCA), in collaboration with the Widow Empowerment Organization and Partners, on Saturday 15th November 2025, took part in a day-long mass sensitization rally against all forms of drug abuse.\r\n\r\nThousands of residents from various organisations and institutions joined the rally by assembling at the Sierra Leone Police barracks field along Hangha Road, using a public address system and other instruments mounted on a canopy, singing, dancing and preaching messages of drug abuse as they proceeded through Hangha Road, Dama Road, Kingsway Street, Combema Road, Sumaila Street, Koroma Street and Hangha Road to the police barracks, where various stakeholders addressed the gathering in connection to drug abuse.\r\n\r\nThe Chief Executive Officer of CADaCT-SL, Saffa Andrew Koroma, while addressing his audience, thanks all and sundry for taking part in the rally, adding the musical performance, drama, poetry, comedy, spiritual counselling, statements and pledges by dignitaries are moves in the right direction in eradicating drug abuse from our society.\r\nSaffa Andrew Koroma, CADaCT-SL CEO, gave thanks to all partners for their diverse support; among them are Trading Organic, Sierra Leone Red Cross, Sierra Leone Police, Republic of Sierra Leone Armed Forces, Eastern Technical University Sierra Leone, 42 secondary schools, Inter Religious Council and other community stakeholders, DHMT, Mr Jimmy Batilo Songa, Radish Bar and Restaurant, Ministry of Gender and Children Affairs, Resident Minister East, Human Rights Commission, Scrap Metals Association, Africel Sierra Leone, Orange Sierra Leone, Mayor of Kenema City Council, Paramount Chiefs, AIG East, BRU, Drivers Union, KDFA and the media outlets (print, electronic and bloggers).\r\n\r\nHe pointed out that the objective of the entire rally is to raise public awareness on the dangers of drug abuse through culturally resonant messaging.\r\n\r\nMobilise corporate, non governmental, and civil society actors to co-invest in prevention and rehabilitation.\r\n\r\nEquip youth and community leaders with knowledge and tools to resist peer pressure and substance misuse. Strengthen referral pathways for treatment, psychosocial support, and reintegration.",
    "status": "past",
    "registrationLink": "",
    "registrationNote": "No registration required Open to all",
    "image": "/uploads/1765031427335-WhatsApp Image 2025-12-05 at 18.15.39_1402d83c.jpg"
  },
  {
    "id": "event-1765042335952",
    "title": "CALL FOR YOUTH FILM CREW & TALENT ",
    "dateFrom": "2025-10-27",
    "dateTo": "2025-11-20",
    "location": "Kenema City ",
    "description": "Are you passionate about storytelling, acting, or filming? Do you want to use your creativity \r\nto inspire change in your community? \r\nThe Coalition Against Drug Abuse and Community Transformation is looking for \r\nenergetic and talented youth volunteers to join our filming crew and serve as actors \r\nand actresses as part of the youth empowerment program \r\nWe’re recruiting: \r\nArt lead, lead photographer, camera operators & Editor, Assistant Technical \r\nlead, Technical lead. Production Assistant, Actors & Actresses (ages 15–35), \r\nVoice-over Artists & Presenters, Creative Writers & Scene Designers \r\n1. Location: Kenema \r\n2. Filming Period: December 2025 to February 2026 \r\n3.  Languages: English, Krio, and local dialects welcome \r\n4. Theme: Youth resilience for community transformation \r\nNo professional experience required for Actors and Actress— just passion, \r\ncommitment, and a desire to make a difference! \r\nHow to Apply: \r\nSend your name, age, contact info, and area of interest to: \r\nsaffacadactsl@gmail.com or sheriffhassan42@gmail.com (+23278526539) or you \r\ncan submit at 12 Kandeh street, CADaCT SL office between the period of \r\n8:30am to 4:30pm each day. \r\nNote: inquires can be done from the 27th October to the 8th November 2025 \r\nDeadline: 20th November 2025 \r\nLet your talent be a voice for change. ",
    "status": "ongoing",
    "registrationLink": "saffacadactsl@gmail.com",
    "registrationNote": "saffacadactsl@gmail.com",
    "image": "/uploads/1765042335937-WhatsApp Image 2025-12-06 at 17.29.43_0e30c36d.jpg"
  },
  {
    "id": "event-1765124632286",
    "title": "Post-Rehabilitation Skills Training Registration – CArCRT-SL & Ministry of Social Welfare",
    "dateFrom": "2025-11-27",
    "dateTo": "",
    "location": "Kenema City",
    "description": "The Coalition for Community Resilience and Transformation – Sierra Leone (CArCRT-SL), in collaboration with the Ministry of Social Welfare, Kenema District, is launching a Post-Rehabilitation Skills Training Program designed to support the reintegration and empowerment of individuals who have successfully completed rehabilitation.\r\n\r\nThis initiative aims to strengthen long-term recovery, stability, and self-reliance by equipping beneficiaries with practical, market-ready skills that can help them rebuild their lives and contribute meaningfully to their communities.\r\n\r\nThe Skills Training Registration Form will collect key information from 100 eligible participants, including personal details, rehabilitation background, preferred training areas, and specific support needs. This information will guide the planning team in tailoring the most appropriate interventions for each applicant. The form also includes consent and a section for committee review to ensure transparency and effective selection.\r\n\r\nAll interested participants are encouraged to apply and make use of this opportunity for sustainable empowerment and community reintegration.",
    "status": "ongoing",
    "registrationLink": "",
    "registrationNote": "Physical registration required – download the form and submit via email",
    "applicationEmail": "saffacadactsl@gmail.com",
    "image": "/uploads/1765124632262-WhatsApp Image 2025-12-07 at 16.19.24_12376ff2.jpg",
    "applicationPdf": "/uploads/1765124632268-POST REHABILITATION TRAINING.pdf"
  }
]