[
  {
    "id": "news-1764961272463",
    "title": "CArCRT Formally Known as CADaCT-SL engages in mass campaign against drug abuse in Kenema",
    "category": [
      "Announcements",
      "Impact",
      "Partnerships",
      "Programs"
    ],
    "excerpt": " Coalition Against Drugs Abuse and Community Transformation (CArCRT-SL). The Cross of Christ Association (CCA), in collaboration with the Widow Empowerment Organization and Partners, on Saturday 15th November 2025, took part in a day-long mass sensitization rally against all forms of drug abuse.",
    "content": "Thousands of residents from various organisations and institutions joined the rally by assembling at the Sierra Leone Police barracks field along Hangha Road, using a public address system and other instruments mounted on a canopy, singing, dancing and preaching messages of drug abuse as they proceeded through Hangha Road, Dama Road, Kingsway Street, Combema Road, Sumaila Street, Koroma Street and Hangha Road to the police barracks, where various stakeholders addressed the gathering in connection to drug abuse.\r\n\r\nThe Chief Executive Officer of CADaCT-SL, Saffa Andrew Koroma, while addressing his audience, thanks all and sundry for taking part in the rally, adding the musical performance, drama, poetry, comedy, spiritual counselling, statements and pledges by dignitaries are moves in the right direction in eradicating drug abuse from our society.\r\nSaffa Andrew Koroma, CADaCT-SL CEO, gave thanks to all partners for their diverse support; among them are Trading Organic, Sierra Leone Red Cross, Sierra Leone Police, Republic of Sierra Leone Armed Forces, Eastern Technical University Sierra Leone, 42 secondary schools, Inter Religious Council and other community stakeholders, DHMT, Mr Jimmy Batilo Songa, Radish Bar and Restaurant, Ministry of Gender and Children Affairs, Resident Minister East, Human Rights Commission, Scrap Metals Association, Africel Sierra Leone, Orange Sierra Leone, Mayor of Kenema City Council, Paramount Chiefs, AIG East, BRU, Drivers Union, KDFA and the media outlets (print, electronic and bloggers).\r\n\r\nHe pointed out that the objective of the entire rally is to raise public awareness on the dangers of drug abuse through culturally resonant messaging.\r\n\r\nMobilise corporate, non governmental, and civil society actors to co-invest in prevention and rehabilitation.\r\n\r\nEquip youth and community leaders with knowledge and tools to resist peer pressure and substance misuse. Strengthen referral pathways for treatment, psychosocial support, and reintegration.\r\n\r\n\r\n\r\n",
    "date": "2025-11-15",
    "image": "/uploads/1764961272394-CEO-CADaCT_SL-Saffa-Andrew-Koroma-addressing-his-audience.png",
    "link": "https://independentobserver-sl.com/2025/11/18/cadact-sl-engages-in-mass-campaign-against-drug-abuse-in-kenema%ef%bf%bc/",
    "videoUrl": ""
  },
  {
    "id": "news-1765032256277",
    "title": "School Sponsorship Program Field Visit – KmDEC Primary School",
    "category": [
      "Announcements",
      "Impact",
      "Programs"
    ],
    "excerpt": "As part of the ongoing School Sponsorship Program led by the Coalition for Community Resilience and Transformation (CArCRT) — formerly known as CADACT-SL — the team conducted a monitoring and validation visit on 24th November 2025",
    "content": "School Sponsorship Program Field Visit – KmDEC Primary School\r\n\r\nAs part of the ongoing School Sponsorship Program led by the Coalition for Community Resilience and Transformation (CArCRT) — formerly known as CADACT-SL — the team conducted a monitoring and validation visit on 24th November 2025.\r\n\r\nA delegation headed by CEO Saffa Andrew Koroma, together with CArCRT staff and interns, visited KmDEC Primary School, one of ten supported schools located on Moiwo Street, Kenema. The visit aimed to verify the accuracy of recent child-sponsorship assessments and address concerns about increased vulnerability among learners.\r\n\r\nThe engagement was successful, and all issues raised by the school administration were addressed collaboratively.\r\n\r\nKey Action Points Identified\r\n\r\nTraining for Guidance Counselors to strengthen psychosocial support.\r\n\r\nTeacher capacity-building on child protection policies and safeguarding laws.\r\n\r\nRegular engagement with parents and caregivers to improve support for vulnerable children.\r\n\r\nProvision of essential learning materials for identified beneficiaries.\r\n\r\nCArCRT remains committed to supporting vulnerable children through inclusive education, strengthened school systems, and community involvement.",
    "date": "2025-11-24",
    "link": "",
    "videoUrl": "",
    "image": "/uploads/1765032256263-WhatsApp Image 2025-12-05 at 16.48.53_0ebaddfc.jpg",
    "document": null
  },
  {
    "id": "news-1765042789811",
    "title": "CArCRT Partners with Sierra Leone Correctional Service to Launch “Project Closed Setting”",
    "category": [
      "Impact",
      "Events",
      "Programs",
      "Partnerships"
    ],
    "excerpt": "As part of our ongoing commitment to community resilience, psychosocial support, and dignity restoration, the Coalition for Community Resilience and Transformation (CArCRT) has initiated a strategic collaboration with the Sierra Leone Correctional Service, Kenema. This partnership aims to strengthen rehabilitation pathways and improve support systems for inmates through our new initiative titled Project Closed Setting.",
    "content": "CArCRT Partners with Sierra Leone Correctional Service to Launch “Project Closed Setting”\r\n\r\nAs part of our ongoing commitment to community resilience, psychosocial support, and dignity restoration, the Coalition for Community Resilience and Transformation (CArCRT) has initiated a strategic collaboration with the Sierra Leone Correctional Service, Kenema. This partnership aims to strengthen rehabilitation pathways and improve support systems for inmates through our new initiative titled Project Closed Setting.\r\n\r\nAbout the Project\r\n\r\nProject Closed Setting focuses on providing holistic rehabilitation and reintegration support for inmates through:\r\n\r\n1. Psychosocial Support & Counseling\r\n\r\nIndividual and group counseling sessions\r\n\r\nTrauma healing and emotional recovery\r\n\r\nMentorship programs to rebuild confidence, resilience, and hope\r\n\r\n2. Skills Training & Entrepreneurship\r\n\r\nPractical vocational training\r\n\r\nEntrepreneurship and business development skills\r\n\r\nOpportunities to prepare inmates for sustainable livelihoods post-release\r\n\r\n3. Dignity Support for Women\r\n\r\nTailored programs for female inmates\r\n\r\nHygiene and dignity kits\r\n\r\nEmpowerment sessions aimed at reducing stigma and restoring self-worth\r\n\r\n4. Reintegration & Safe Life After Prison\r\n\r\nStructured reintegration planning\r\n\r\nCommunity mentorship and referral pathways\r\n\r\nAgribusiness and livelihood opportunities to support a smooth transition back into society\r\n\r\nOur Commitment\r\n\r\nThrough this partnership, CArCRT continues to champion inclusive rehabilitation, promote human dignity, and support second chances for individuals in closed settings. We believe that every person—regardless of circumstance—deserves access to healing, growth, and the opportunity to rebuild their lives.",
    "date": "2025-12-03",
    "link": "https://x.com/carcrt_sl?t=vxSi3-4H0exLpm01POd66w&s=09",
    "videoUrl": "",
    "image": "/uploads/1765042789799-WhatsApp Image 2025-12-06 at 14.19.17_6dd6d538.jpg",
    "document": null
  },
  {
    "id": "news-1765043277172",
    "title": "CArCRT (formerly CADacT) Joins the Ministry of Social Welfare on Visit to Daru Drug Rehabilitation Facility",
    "category": [
      "Impact",
      "Events",
      "Programs",
      "Announcements",
      "Partnerships"
    ],
    "excerpt": "On 18th November 2025, the Ministry of Social Welfare, in collaboration with the Coalition for Community Resilience and Transformation (CArCRT), formerly known as CADacT, conducted an official visit to the Government’s Harmful Drug Rehabilitation Facility in Daru, Jawei Chiefdom, Kailahun District.\r\n\r\nThe visit aimed to assess ongoing rehabilitation efforts, encourage recovering victims, and reaffirm national commitment toward ending the harmful drug crisis affecting Sierra Leone’s youth.",
    "content": "CArCRT (formerly CADacT) Joins the Ministry of Social Welfare on Visit to Daru Drug Rehabilitation Facility\r\n\r\nOn 18th November 2025, the Ministry of Social Welfare, in collaboration with the Coalition for Community Resilience and Transformation (CArCRT), formerly known as CADacT, conducted an official visit to the Government’s Harmful Drug Rehabilitation Facility in Daru, Jawei Chiefdom, Kailahun District.\r\n\r\nThe visit aimed to assess ongoing rehabilitation efforts, encourage recovering victims, and reaffirm national commitment toward ending the harmful drug crisis affecting Sierra Leone’s youth.\r\n\r\nGovernment’s Commitment to Rehabilitation\r\n\r\nDuring the visit, Mr. Darlington Kajua Sesay, Director of Social Welfare (East), highlighted the Government’s multi-pronged approach to rehabilitation.\r\nHe noted that functional facilities are already established in:\r\n\r\nHastings (Freetown)\r\n\r\nGondama (Bo)\r\n\r\nDaru (Kailahun)\r\n\r\nPlans are underway to establish an additional centre in Teko (Makeni).\r\nHe emphasized the crucial support of the military in helping rebuild the future of Sierra Leone through structured rehabilitation.\r\n\r\nCArCRT’s Stand Against Drug Abuse\r\n\r\nAndrew Saffa Koroma, CEO of CArCRT (formerly CADacT), expressed deep concern about the alarming rise of Kush and other synthetic drugs, calling the situation a national crisis that threatens the country’s future.\r\n\r\nHe commended Minister Melrose Karminty, Minister of Social Welfare, for her unwavering support and leadership in the national fight against drugs.\r\n\r\nSaffa reaffirmed CArCRT’s determination to contribute through:\r\n\r\nPrevention programs\r\n\r\nRehabilitation support\r\n\r\nJustice and community accountability\r\n\r\nHe concluded by calling on all Sierra Leoneans to unite and save the nation’s youth from the destructive grip of harmful drugs.\r\n\r\nVoices of Concern and Compassion\r\n\r\nMadam Nancy Admire Mustapha, Executive Director of Widows Empowerment, grew visibly emotional as testimonials were shared—especially the story of Jimmy Jajua, one of the recovering victims.\r\n\r\nShe reminded the youths:\r\n\r\n“If you destroy your future now, no one will be left to develop Sierra Leone. We see potential in all of you, and that is why we are here.”\r\n\r\nRepresenting the Sierra Leone Police, Sub-Inspector Brima James Musa, Head of Media (East), strongly condemned those producing and selling Kush—including parents who profit from the trade—describing it as a betrayal of parental duty.\r\n\r\nCentre Updates\r\n\r\nPastor Solomon Kamara, Acting Centre Coordinator, expressed gratitude to President Bio for his timely leadership in addressing the drug crisis.\r\n\r\nProviding statistics, Elizabeth Katay Toogbabu, Social Worker (Kenema Regional Office), reported that the centre currently hosts:\r\n\r\n39 service users\r\n\r\n34 males\r\n\r\n5 females\r\n\r\nThe facility is structured into two sections (male and female), with separate billets:\r\n\r\n3 billets for males\r\n\r\n1 billet for females\r\n\r\nConclusion\r\n\r\nThe visit ended with group photos, engagement sessions, and psychosocial counselling for the recovering clients.\r\n\r\nCArCRT remains committed to supporting the Government and communities in building resilience, restoring dignity, and protecting Sierra Leone’s youth.",
    "date": "2025-11-18",
    "link": "https://x.com/carcrt_sl?t=vxSi3-4H0exLpm01POd66w&s=09",
    "videoUrl": "",
    "image": "/uploads/1765043277163-583336882_122189023610503282_630279455422188238_n.jpg",
    "document": null
  },
  {
    "id": "news-1765043800184",
    "title": "CArCRT (formerly CADacT) and Partners Engage the Public Ahead of November 15th Drugs Campaign in Kenema",
    "category": [
      "Announcements",
      "Impact",
      "Events",
      "Programs",
      "Partnerships"
    ],
    "excerpt": "CArCRT (formerly CADacT) and Partners Engage the Public Ahead of November 15th Drugs Campaign in Kenema\r\n\r\nAhead of the November 15th Drugs Campaign in Kenema, the Coalition for Community Resilience and Transformation (CArCRT), formerly CADacT, and its partners appeared on a simulcast radio discussion to speak on their readiness and collective commitment to the upcoming campaign.\r\n\r\nThe program focused on community mobilisation, enforcement collaboration, rehabilitation pathways, and the urgent need to protect young people from harmful drug abuse—especially Kush.",
    "content": "CArCRT (formerly CADacT) and Partners Engage the Public Ahead of November 15th Drugs Campaign in Kenema\r\n\r\nAhead of the November 15th Drugs Campaign in Kenema, the Coalition for Community Resilience and Transformation (CArCRT), formerly CADacT, and its partners appeared on a simulcast radio discussion to speak on their readiness and collective commitment to the upcoming campaign.\r\n\r\nThe program focused on community mobilisation, enforcement collaboration, rehabilitation pathways, and the urgent need to protect young people from harmful drug abuse—especially Kush.\r\n\r\nGuest Speakers\r\n\r\nSaffa Andrew Koroma – CEO, CArCRT (formerly CADacT)\r\n\r\nBob Musa Mansaray – LUC, Kenema Police Division\r\n\r\nNancy A. Mustapha – Executive Director, Widows Empowerment Organization, Kenema\r\n\r\nJamie Brima – Widows Empowerment Organization, Kenema\r\n\r\nPresenter\r\n\r\nHassan Sheriff\r\n\r\nHost Radio\r\n\r\nKamboi Agriculture Radio\r\n\r\nThe broadcast served as a united call to action, emphasizing prevention, rehabilitation support, and strong community involvement in the fight against drug misuse in Sierra Leone.",
    "date": "2025-11-14",
    "link": "https://www.facebook.com/share/v/1ByQ1n8stE/",
    "videoUrl": "https://www.facebook.com/share/v/1ByQ1n8stE/",
    "image": null,
    "document": null
  },
  {
    "id": "news-1765125672112",
    "title": "Media Engagement: CArCRT-SL on Nyapui Radio – “Insai Salone” (16 Days of Activism Edition)",
    "category": [
      "Impact",
      "Programs"
    ],
    "excerpt": "As part of the ongoing 16 Days of Activism Against Gender-Based Violence, the Coalition for Community Resilience and Transformation – Sierra Leone (CArCRT-SL) participated in today’s edition of the “Insai Salone” program on Nyapui Radio.",
    "content": "Media Engagement: CArCRT-SL on Nyapui Radio – “Insai Salone” (16 Days of Activism Edition)\r\n\r\nAs part of the ongoing 16 Days of Activism Against Gender-Based Violence, the Coalition for Community Resilience and Transformation – Sierra Leone (CArCRT-SL) participated in today’s edition of the “Insai Salone” program on Nyapui Radio.\r\n\r\nThe conversation focused on the organization’s continued efforts in drug abuse prevention, community resilience, gender justice, and youth protection, aligning with this year's global call to action to end all forms of violence and harm in communities.\r\n\r\nThrough this media engagement, CArCRT-SL reaffirmed its commitment to:\r\n\r\nRaising awareness on the impact of substance abuse and gender-based violence\r\n\r\nEmpowering communities with information and prevention strategies\r\n\r\nAdvocating for safer, healthier, and more resilient communities\r\n\r\nThis appearance underscores the coalition’s dedication to amplifying voices, strengthening partnerships, and driving national action throughout the 16 Days of Activism campaign.",
    "date": "2025-12-02",
    "link": "https://www.facebook.com/share/v/1Bv2Fu6BkP/",
    "videoUrl": "https://www.facebook.com/share/v/1Bv2Fu6BkP/",
    "image": "/uploads/1765125989841-WhatsApp Image 2025-12-06 at 18.11.16_e8c806ac.jpg",
    "document": null
  },
  {
    "id": "news-1765126222846",
    "title": "Day 13 – 16 Days of Activism Against Gender-Based Violence",
    "category": [
      "Announcements",
      "Impact",
      "Programs",
      "Events",
      "Partnerships"
    ],
    "excerpt": "CArCRT-SL Engages Ansarul Islamic Secondary School, Kenema\r\n\r\nOn Day 13 of the global 16 Days of Activism, the Coalition for Community Resilience and Transformation (CArCRT-SL) conducted an impactful awareness session at Ansarul Islamic Secondary School, Kenema, focusing on the ongoing fight to end digital violence against women and girls.",
    "content": "Day 13 – 16 Days of Activism Against Gender-Based Violence\r\nCArCRT-SL Engages Ansarul Islamic Secondary School, Kenema\r\n\r\nOn Day 13 of the global 16 Days of Activism, the Coalition for Community Resilience and Transformation (CArCRT-SL) conducted an impactful awareness session at Ansarul Islamic Secondary School, Kenema, focusing on the ongoing fight to end digital violence against women and girls.\r\n\r\nThe engagement brought together students, teachers, and school administrators to discuss the growing risks of online harassment, cyberbullying, and harmful digital behaviors that disproportionately affect girls and young women.\r\n\r\nDuring the session, the CArCRT-SL team encouraged both boys and girls to:\r\n\r\nPromote responsible and respectful online behavior\r\n\r\nCreate and protect safe digital spaces\r\n\r\nChallenge harmful stereotypes and digital abuse\r\n\r\nStand up for victims and report incidents of cyberviolence\r\n\r\nThe organization emphasized that everyone—regardless of gender or background—deserves safety, respect, and dignity online.\r\n\r\nThis activity is part of CArCRT-SL’s commitment to building resilient communities and empowering the next generation to champion a safer digital environment for all.",
    "date": "2025-12-07",
    "link": "https://www.linkedin.com/company/coalition-for-community-resilience-and-transformation-carcrt/posts/?feedView=all",
    "videoUrl": "",
    "image": "/uploads/1765126222845-WhatsApp Image 2025-12-07 at 16.45.50_988de866.jpg",
    "document": null
  }
]